[
  {
    "title": "About Me Site",
    "publishedOn": "2015-11-15",
    "category": "Website",
    "body": "<p>This is a site that was built early on in my formal web development learning process.</p><p>Disclaimer: This project does not necessarily reflect my current abilities. It's a nice reminder of how far I've come. I'd love to revisit this at a later date to improve the navigation design (specifically for mobile) and game interface.</p>  <p>Technologies used: HTML, CSS, JavaScript.</p><p><img src=\"/images/aboutme.png\"/></p>",
    "projectURL": "http://deeheber.github.io/About-Me/"
  },
  {
    "title": "Donut Shop",
    "publishedOn": "2015-11-25",
    "category": "Tooling",
    "body": "<p>This app is a forecaster for a fictional donut shop with multiple locations. The target audience for using this app is the shop employess.</p><p>I began by building out the tables for each shop's data using HTML and then gradually added more functionality through JavaScript to dynamically fill the data in the tables. This taught me how to better utilize JavaScript Objects to store data within an application and to build out things with scalability in mind.</p><p>My favorite feature is the interactivity where the user can select a specific shop to show as well as update the data within the tables.</p><p>Some enhancement ideas include but aren't limited to: adding an input field where the user can add a new shop table to the app as well as adding persistence to store the changes made to the numbers that the user has entered.</p><p><img src=\"/images/donutshop.png\" /></p>",
    "projectURL": "http://deeheber.github.io/Donut-Shop/"
  },
  {
    "title": "Vote Tracker",
    "publishedOn": "2015-12-06",
    "category": "Tooling",
    "body": "<p>This app allows users to vote on their preferred item, stores the vote, and then displays the totals in a graph using the <a href=\"http://canvasjs.com/\" target=\"_blank\">canvasJS</a> library.</p><p>This was one of the first times that I've worked with a third party developed JavaScript library and it was a lot of fun.</p><p>Technologies used: HTML, CSS, JavaScript, and the canvasJS library.</p><p><img src=\"/images/votetracker.png\" /></p>",
    "projectURL": "http://deeheber.github.io/Vote-Tracker/"
  },
  {
    "title": "Discover Portland",
    "publishedOn": "2015-12-21",
    "category": "Collaboration",
    "body": "<p>Unsure what to do this weekend in Portland, OR? Well you're in luck, because this site suggests activities in the area.</p><p>This was one of my first collaboration projects using git. My team was looking to solve the problem of not being able to decide what to do when you have visitors from out of town.</p><p>This app also keeps the currently selected radio boxes in the browser's local storage, just in case the site visitor navigates away from the page to view an external resource and wants to come back to the activities page just as they left it.</p> <p>My main contribution to this was writing the underlying  JS logic for the radio buttons on the 'activities' page. I also contributed to the overall design, structure, and styles for the pages as well.</p><p><img src=\"/images/discoverportland.png\"/></p>",
    "projectURL": "http://risachi.github.io/travel-project/"
  },
  {
    "title": "Rock Paper Scissors",
    "publishedOn": "2015-12-24",
    "category": "Game",
    "body": "<p>Originally, I built this game to teach myself flow control via if/else statements in JavaScript, but this actually turned into a much larger project.</p><p>I ended up going on a side tangent of exploring of Google's <a href=\"https://developer.chrome.com/extensions/getstarted/\" target=\"_blank\">developer documentation</a> and realized that building a Chrome extension was much easier than I originally thought.</p><p>Some add ons that I'd like to explore in the future include: adding persistence, so the choices/scores stay in place if you close out of the popup. It would also be neat to refactor this code to be a bit more compact, possibly with a library such as jQuery.</p><p>Technologies used: HTML, CSS, JavaScript, JSON.</p><p><img src=\"/images/rps.png\"/></p>",
    "projectURL": "https://chrome.google.com/webstore/detail/rock-paper-scissors/ngdfhjfgdakniamhoodbaljgoaoollok"
  },
  {
    "title": "Portfolio Blog",
    "publishedOn": "2016-01-19",
    "category": "Website",
    "body": "<p>You're currently looking at it!</p><p>This blog was built using an MVC approach along with some functional programming concepts. It also incorporates third party libraries including <a href=\"http://handlebarsjs.com/\" target=\"_blank\">Handlebars</a> and jQuery. AJAX calls within the jQuery fetch and load the JSON data.</p>",
    "projectURL": "https://github.com/deeheber/code-blog"
  }
]
