[
  {
    "title": "First Project",
    "publishedOn": "2015-12-11",
    "category": "firstCat",
    "body": "<p>This is the body text for project 1.</p><p>Zombie ipsum reversus ab viral inferno, nam rick grimes malum cerebro.</p>  <p>De carne lumbering animata corpora quaeritis. <img src=\"http://www.travelportland.com/wp-content/uploads/2013/08/Plan_PDXByBike_BikeEastbankEsplanade_courtesy_TravelPortland.jpg\" >Summus brains sit , morbo vel maleficia? De apocalypsi gorger omero undead survivor dictum mauris. Hi mindless mortuis soulless creaturas, imo evil stalking monstra adventus resi dentevil vultus comedat cerebella viventium.</p>",
    "projectURL": "http://www.google.com"
  },
  {
    "title": "Second Project",
    "publishedOn": "2016-01-05",
    "category": "secondCat",
    "body": "<p>This is the body text for project 2</p><p>Meow destroy the blinds but white cat sleeps on a black shirt if it <img src=\"http://techonomy.com/wp-content/uploads/2013/04/shutterstock_42765808-610x354.jpg\" /> smells like fish eat as much as you wish. Wake up human for food at 4am stretch, so refuse to leave cardboard box yet stare out the window yet flop over. Claws in your leg. </p><p>Meow destroy the blinds but white cat sleeps on a black shirt if it smells like fish eat as much as you wish. Wake up human for food at 4am stretch, so refuse to leave cardboard box yet stare out the window yet flop over. Claws in your leg. </p>",
    "projectURL": "http://www.yahoo.com"
  },
  {
    "title": "Third Project",
    "publishedOn": "2014-12-14",
    "category": "thirdCat",
    "body": "<p>This is the body text for project 3</p><p>Austin irony disrupt, listicle everyday carry chicharrones four dollar toast. Cliche yuccie hoodie fap tousled pop-up. Plaid<img src=\"https://www.phase2technology.com/wp-content/uploads/2014/06/Portland.jpg\" /> typewriter roof party sriracha iPhone, cornhole tumblr dreamcatcher photo booth +1 tilde biodiesel. Celiac meh austin cardigan, shoreditch aesthetic typewriter helvetica art party tote bag direct trade tacos tousled mumblecore locavore. Lomo affogato blog, slow-carb sriracha salvia messenger bag. Everyday carry kombucha intelligentsia, pickled tacos yr stumptown trust fund literally semiotics polaroid heirloom.</p>",
    "projectURL": "http://www.codefellows.org"
  },
  {
    "title": "Fourth Project",
    "publishedOn": "2013-05-21",
    "category": "firstCat",
    "body": "<p>This is the body text for project 4 with firstCat category.</p><p>Zombie ipsum reversus ab viral inferno, nam rick grimes malum cerebro. De carne lumbering animata corpora quaeritis. Summus brains sit , morbo vel maleficia? De apocalypsi <img src=\"https://www.travelportland.com/wp-content/uploads/2013/04/portland-streetcar-downtown.jpg\" />gorger omero undead survivor dictum mauris. Hi mindless mortuis soulless creaturas, imo evil stalking monstra adventus resi dentevil vultus comedat cerebella viventium.</p>",
    "projectURL": "http://www.google.com"
  }
]
