[
  {
    "title": "About Me Site",
    "publishedOn": "2015-11-15",
    "category": "website",
    "body": "<p>This is a site that was built early on in my formal web development learning process.</p><p>I'm currently utilizing this old project as a learning opportunity by refactoring my past code.</p>  <p>Technologies used: HTML, CSS, JavaScript, and jQuery.</p><p><img src=\"/images/aboutme.png\"/></p>",
    "projectURL": "http://deeheber.github.io/About-Me/"
  },
  {
    "title": "Donut Shop",
    "publishedOn": "2015-11-25",
    "category": "tooling",
    "body": "<p>This app is a forecaster for a fictional donut shop with multiple locations. The target audience for using this app is the shop employess.</p><p>I began by building out the tables for each shop's data using HTML and then gradually added more functionality through JavaScript to dynamically fill the data in the tables. This project gave me some practice in better utilizing JavaScript Objects to store data.</p><p>My favorite feature is the interactivity where the user can select a specific shop to show as well as update the data within the tables.</p><p><img src=\"/images/donutshop.png\" /></p>",
    "projectURL": "http://deeheber.github.io/Donut-Shop/"
  },
  {
    "title": "Vote Tracker",
    "publishedOn": "2015-12-06",
    "category": "tooling",
    "body": "<p>This app allows users to vote on their preferred item, stores the vote, and then displays the totals in a graph using the <a href=\"http://canvasjs.com/\" target=\"_blank\">canvasJS</a> library.</p><p>This was one of the first times that I've worked with a third party developed JavaScript library and it was a lot of fun.</p><p>Technologies used: HTML, CSS, JavaScript, and the canvasJS library.</p><p><img src=\"/images/votetracker.png\" /></p>",
    "projectURL": "http://deeheber.github.io/Vote-Tracker/"
  },
  {
    "title": "Discover Portland",
    "publishedOn": "2015-12-21",
    "category": "collaboration",
    "body": "<p>Unsure what to do this weekend in Portland, OR? Well you're in luck, because this site suggests activities in the area.</p><p>This was one of my first collaboration projects using git. My team was looking to solve the problem of not being able to decide what to do when you have visitors from out of town.</p><p>This app also keeps the currently selected radio boxes in the browser's local storage, just in case the site visitor navigates away from the page to view an external resource and wants to come back to the activities page just as they left it.</p> <p>My main contribution to this was writing the underlying  JS logic for the radio buttons on the 'activities' page.</p><p><img src=\"/images/discoverportland.png\"/></p>",
    "projectURL": "http://risachi.github.io/travel-project/"
  },
  {
    "title": "Rock Paper Scissors",
    "publishedOn": "2015-12-24",
    "category": "game",
    "body": "<p>Originally, I built this game to practice flow control via if/else statements in JavaScript, but this actually turned into a much larger project.</p><p>I ended up going on a side tangent of exploring of Google's <a href=\"https://developer.chrome.com/extensions/getstarted/\" target=\"_blank\">developer documentation</a> and realized that building a Chrome extension was much easier than I originally thought.</p><p>Technologies used: HTML, CSS, JavaScript, JSON.</p><p><img src=\"/images/rps.png\"/></p>",
    "projectURL": "https://chrome.google.com/webstore/detail/rock-paper-scissors/ngdfhjfgdakniamhoodbaljgoaoollok"
  },
  {
    "title": "Portfolio Blog",
    "publishedOn": "2016-01-19",
    "category": "website",
    "body": "<p>You're currently looking at it!</p><p>This blog was built using an MVC approach along with some functional programming concepts. It also incorporates third party libraries including <a href=\"http://handlebarsjs.com/\" target=\"_blank\">Handlebars</a>, page.js, and jQuery. AJAX calls within the jQuery fetch and load the JSON data.</p>",
    "projectURL": "https://github.com/deeheber/code-blog"
  },
  {
    "title": "Bike Bright",
    "publishedOn": "2016-02-27",
    "category": "collaboration",
    "body": "<p>I was outraged when my bicycle seat was stolen. After discussing this problem with a few colleagues, we found that others also had similiar experiences. We decided to combine our efforts and talents to build out a solution on our own.</p><p>This app was built with a mobile first apprach with the angle that cyclists in Portland, OR would be using this while on the go. The heart of the application is the map in which we customized using the Google Maps JavaScript API. Some features of the map include a heatmap that shows simulated crime data, bicycle parking locations, and a location finder. We also had the vision of creating a small peer to peer community and added a discussion board using Disqus.</p><p>My primary contributions indcluded adding the user interactivity to hide/show the different data layers for the map and also adding in the functions to build those custom data layers.</p><p>Some enhancements we'd like to add in the 2.0 version include obtaining data sources from the Portland Police in order to dynamically populate that data. One of the biggest challenges while building this was being able to get access to accurate data with enough data points to build out a heatmap, so the current version is simulated data based off of data points from <a href=\"http://www.civicapps.org\" target=\"_blank\">civicapps.org</a>.</p><p><img src=\"/images/bikebright.png\"/></p>",
    "projectURL": "https://bikebright.herokuapp.com/"
  },
  {
    "title": "To Do List",
    "publishedOn": "2016-04-14",
    "category": "tooling",
    "body": "<p>A minimal to do list that stores the task data in the browser's local storage. So when you come back it'll be just as you left it. Users have the option to add a task, mark a task as complete, delete an existing task, and edit an exisiting task.</p><p>I decided to revisit DOM manipulation without any external JavaScript libraries in this project. Technologies used: HTML, CSS, JavaScript.</p></p><p><img src=\"/images/todolist.png\"/></p>",
    "projectURL": "http://deeheber.github.io/to-do-list/"
  },
  {
    "title": "Node Weather",
    "publishedOn": "2016-06-07",
    "category": "tooling",
    "body": "<p>A command line application that allows you to find the current weather in a given United States location. Technologies used: node.js.</p><p>More detailed usage insructions can be found in the readme file on the GitHub repository.</p></p><p><img src=\"/images/nodeWeather.gif\"/></p>",
    "projectURL": "https://github.com/deeheber/node-weather"
  }
]
